import React from "react";

import { TimeLineItem } from './components/index';

export const RoadMapSection = () => {

    return(
        <section className="roadmap" id="roadmap">
            <h2 className="heading">Алгоритм обробки скарг</h2>

            <div className="timeline-items">

                <TimeLineItem number={1} subTitle={"Громадянин має можливість повідомити про підозрілі випадки корупції через онлайн-портал. Для цього потрібно заповнити форму, вказавши деталі випадку та надати необхідні докази (якщо доступні). Усі дані захищені, і конфіденційність повідомника гарантована."} title={"Особа подає інформацію про факти корупції"}/>
                <TimeLineItem number={2} subTitle={"Уповноважені антикорупційні фахівці Департаменту з питань виховання доброцесності та запобігання корупції у секторі безпеки та оборони України переглядають інформацію, надану системою, та перевіряють її на предмет достовірності та достатності доказів. На цьому етапі проводиться детальний аналіз отриманих даних для прийняття подальших рішень."} title={"Спеціалістами здійснюється розгляд повідомлення"}/>
                <TimeLineItem number={3} subTitle={"У випадку підтвердження ознак корупції, інформація передається відповідним слідчим органам для відкриття розслідування. Слідчі органи починають юридичний процес з метою розслідування та притягнення винних до відповідальності."} title={"Скарга направляється до уповноважених слідчих органів"}/>
                <TimeLineItem number={4} subTitle={"Після завершення розгляду, повідомник отримує зворотний зв’язок із результатами розгляду його скарги. Це може бути повідомлення про відкриття розслідування, відхилення скарги або завершення розслідування з відповідними результатами."} title={"Особа отримує результати розгляду повідомлення"}/>

            </div>
        </section>
    );
}