import React from "react";
import { QuestionBox } from "./components/index";

export const FAQSection = () => {

    return(
        <section className="faq" id="faq">
            <h2 className="heading">Часті питання</h2>

            <div className="questions-container">

                <QuestionBox title={"Що таке CATS?"} text={"Corruption Assessment and Transparency System - портал Департаменту з питань запобігання та виявлення корупції Міністерства оборони України, який є ключовим механізмом боротьби з корупцією, забезпечення моніторингу і контролю за дотриманням антикорупційних стандартів, а також  можливості громадянам повідомляти про випадки корупційної діяльності в секторі оборони."}/>
                <QuestionBox title={"Якими уповноваженими підрозділами проводиться слідство?"} text={"Якщо буде встановлено, що повідомлення містить інформацію про корупційне або пов’язане з корупцією правопорушення, буде запропоновано подати повідомлення по регулярному каналу – НАБУ, Національній Поліції або Державному бюро розслідувань."}/>
                <QuestionBox title={"Зміст повідомлення?"} text={"Повідомлення про корупцію має містити фактичні дані про корупційне або пов’язане з корупцією правопорушення, інше порушення Закону України «Про запобігання корупції», які можуть бути перевірені. \nФактичні дані – це відомості про обставини правопорушення, місце і час його вчинення, особу, яка вчинила правопорушення, тощо."}/>
                <QuestionBox title={"Куди надходить подане повідомлення?"} text={"Повідомлення про корупцію, подане через портал, надходить до Департаменту з питань запобігання та виявлення корупції Міністерства оборони України і розглядається уповноваженими особами Департаменту"}/>
                <QuestionBox title={"Як можна подати повідомлення?"} text={"На порталі натисніть кнопку «Подати повідомлення про корупцію», введіть таку інформацію та оберіть такі дії:\nоберіть організацію, про корупцію в якій ви хочете повідомити;\nвкажіть, хто вчинив правопорушення;\nнапишіть свої особисті дані (у разі подання повідомлення із зазначенням відомостей про себе), у разі якщо ви хочете повідомити анонімно, для зручності залиште електронну пошту, на яку надійде ідентифікатор;\nіз переліку виберіть, про яке правопорушення ви бажаєте повідомити;\nзазначте джерело отримання інформації;\nнапишіть обставини правопорушення та прикріпіть підтверджуючі матеріали;\nпоставте відмітку про ознайомлення з правилами порталу.\nПісля завершення всіх дій ви отримаєте унікальний ідентифікатор, за допомогою якого зможете перевіряти статус повідомлення, набуття вами статусу викривача та користуватися правами і гарантіями викривача у разі набуття вами такого статусу.\n\nАбо ж можна поспілкуватися з ШІ помічником в одному із запропонованих мессенджерах"}/>
                <QuestionBox title={"Яка роль штучного інтелекту в даній системі?"} text={"Якщо заявник подає скарга через мессенджери (Телеграм, Whatsapp), то він безпосередньо спілкується з ШІ помічником Департаменту, який збирає всю необхідну інформацію для формування повідомлення. Навіть якщо користувач під час чат сесії змінить мессенджер, то історія повідомлень збережеться. Повідомлення проходить перевірку на відповідність та доречність, тобто унеможливлює спам.\nКоли скарга надходить до системи, ШІ визначає ймовірні статті правопорушення та пропонує їх Оператору Департаменту. Також ШІ визначає якому уповноваженому органу направити скаргу для проведення слідства."}/>

            </div>
        </section>
    );
}